## Staging: load_testing
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.policy will be created
  + resource "aws_ecr_lifecycle_policy" "policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "load_test"
    }

  # aws_ecr_repository.load_test_repository will be created
  + resource "aws_ecr_repository" "load_test_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "load_test"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_lambda_function.load_testing must be replaced
-/+ resource "aws_lambda_function" "load_testing" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:LoadTesting" -> (known after apply)
      - filename                       = "/tmp/load_testing.zip" -> null
      - handler                        = "lambda_locust.handler" -> null
      ~ id                             = "LoadTesting" -> (known after apply)
      + image_uri                      = (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:LoadTesting/invocations" -> (known after apply)
      ~ last_modified                  = "2023-02-22T13:09:04.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:LoadTesting:$LATEST" -> (known after apply)
      - runtime                        = "python3.8" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "P0vgobr+oJxiTmFQKyLG8Xwymg/Wlqg28ZICsD3Rtao=" -> (known after apply)
      ~ source_code_size               = 52409437 -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
